## 01.함수 매핑
<h3> 기존 판다스로 안되는 부분 보강 </h3>

In [1]:
# seaborn 라이브러리 불러오기 
import seaborn as sns

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
df['ten'] = 10
print(df.head())
print('\n')

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [22]:
#사용자 정의 함수 
def add_10(n):
    #print(f"add_10({n})")
    return n+10

def add_two_obj(a,b):
    #print(f"add_10({a}+{b})")
    return a+b

<h3> 함수를 판다스에 적용시켜보자

In [26]:
sr1 = df['age'].apply(add_10) # n= df['age'] 의 모든 원소를 n에 대입 (for loop 효과 )

In [27]:
print('/n')
sr1.head()

/n

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [28]:
sr1.shape

(891,)

In [29]:
type (sr1)

pandas.core.series.Series

In [30]:
# 시리즈 객체와 숫자에 적용 : 2개의 인수(시리즈 + 숫자)
sr2 = df['age'].apply(add_two_obj, b=10)    # a=df['age']의 모든 원소, b=10
print(sr2.head())
print('\n')

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

In [25]:

# 람다 함수 활용: 시리즈 객체에 적용
sr3 = df['age'].apply(lambda x: add_10(x))  # x=df['age']
print(sr3.head())


sr4 = df['age'].apply(lambda n : n+10)
print(sr4.head())

0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64
0    32.0
1    48.0
2    36.0
3    45.0
4    45.0
Name: age, dtype: float64

## version 2

In [96]:
# seaborn 라이브러리 불러오기 
import seaborn as sns

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
df['ten'] = 10
print(df.head())
print('\n')

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [99]:
#사용자 정의 함수 
def add_two(a, b):
    #print(f"add_two({a})+({b})")
    return a + b

In [103]:
#[문제] 컬럼 : age, ten 을 apply() 함수로 전달하여 
# age + ten의 결과를 새로운 컬럼 ageten으로 만들어 넣어라 
sr['ageten'] = df[['age']].apply(add_two, b = (df['ten'].values))

SyntaxError: incomplete input (1696181744.py, line 4)

In [101]:
#sr['ageten'] = df['age'].apply(add_two, b = (df['ten']))

In [102]:
print(sr['ageten'].head())

    0     1     2     3     4     5     6     7     8     9    ...   881  \
0  32.0  32.0  32.0  32.0  32.0  32.0  32.0  32.0  32.0  32.0  ...  32.0
1  48.0  48.0  48.0  48.0  48.0  48.0  48.0  48.0  48.0  48.0  ...  48.0
2  36.0  36.0  36.0  36.0  36.0  36.0  36.0  36.0  36.0  36.0  ...  36.0
3  45.0  45.0  45.0  45.0  45.0  45.0  45.0  45.0  45.0  45.0  ...  45.0
4  45.0  45.0  45.0  45.0  45.0  45.0  45.0  45.0  45.0  45.0  ...  45.0

    882   883   884   885   886   887   888   889   890
0  32.0  32.0  32.0  32.0  32.0  32.0  32.0  32.0  32.0
1  48.0  48.0  48.0  48.0  48.0  48.0  48.0  48.0  48.0
2  36.0  36.0  36.0  36.0  36.0  36.0  36.0  36.0  36.0
3  45.0  45.0  45.0  45.0  45.0  45.0  45.0  45.0  45.0
4  45.0  45.0  45.0  45.0  45.0  45.0  45.0  45.0  45.0

[5 rows x 891 columns]

In [83]:
df['ten']

0      10
1      10
2      10
3      10
4      10
       ..
886    10
887    10
888    10
889    10
890    10
Name: ten, Length: 891, dtype: int64

In [104]:
#선생님 

sr4 = df

### 6.2

In [105]:
# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
print(df.head())
print('\n')

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [107]:
# 사용자 함수 정의
def add_10(n):   # 10을 더하는 함수
    return n + 10

In [108]:
# 데이터프레임에 applymap()으로 add_10() 함수를 매핑 적용
df_map = df.applymap(add_10)   
print(df_map.head())

    age     fare
0  32.0  17.2500
1  48.0  81.2833
2  36.0  17.9250
3  45.0  63.1000
4  45.0  18.0500

### 6.3

In [109]:
# 사용자 함수 정의
def missing_value(series):# 시리즈를 인수로 전달
    global missing_value_cnt
    missing_value_cnt += 1
    return series.isnull()    # 불린 시리즈를 반환
    
# 데이터프레임의 각 열을 인수로 전달하면 데이터프레임을 반환
result = df.apply(missing_value, axis=0)  
print(result.head())
print('\n')
print(type(result))

#2번 호출 : 각 컬럼 단위로 2번 호출 
print("총 함수 호출 횟수 : ", missing_value_cnt)

     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False


<class 'pandas.core.frame.DataFrame'>

In [114]:
#칼럼(age, fare)를 묶어서 True, False갯수 
age_count = result['age'].value_counts()

In [115]:
print(age_count)

age
False    714
True     177
Name: count, dtype: int64

In [116]:
fare_counts = result['fare'].value_counts()

In [117]:
print(fare_counts)

fare
False    891
Name: count, dtype: int64

In [134]:
# 6.4 

# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
print(df.head())
print('\n')

    age     fare
0  22.0   7.2500
1  38.0  71.2833
2  26.0   7.9250
3  35.0  53.1000
4  35.0   8.0500

In [261]:
# 사용자 함수 정의
def min_max(x): 
    #print(f"x.max({x.max})- x.min({x.min})")# 최대값 - 최소값
    return x.max() - x.min()
    
# 데이터프레임의 각 열을 인수로 전달하면 시리즈를 반환
result = df.apply(min_max)   #기본값 axis=0 
print(result)
print('\n')
print(type(result))


for i in result.index:
    print( ": ", result[i])

age      79.5800
fare    512.3292
ten       0.0000
dtype: float64


<class 'pandas.core.series.Series'>
:  79.58
:  512.3292
:  0.0

In [136]:
#검산

In [139]:
age = df['age'].max() - df['age'].min()
fare = df['fare'].max() - df['fare'].min()

print(f"age ({age}) , fare({fare})")

age (79.58) , fare(512.3292)

## 6.5 데이터프레임의 각행에 함수 매핑

In [262]:
# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
df['ten'] = 10
print(df.head())
print('\n')

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [268]:
df2 = df.transpose()
df3 = df2

In [269]:
print(df2.head(5))

        0        1       2     3      4        5        6       7        8    \
age   22.00  38.0000  26.000  35.0  35.00      NaN  54.0000   2.000  27.0000
fare   7.25  71.2833   7.925  53.1   8.05   8.4583  51.8625  21.075  11.1333
ten   10.00  10.0000  10.000  10.0  10.00  10.0000  10.0000  10.000  10.0000

          9    ...      881      882   883    884     885   886   887    888  \
age   14.0000  ...  33.0000  22.0000  28.0  25.00  39.000  27.0  19.0    NaN
fare  30.0708  ...   7.8958  10.5167  10.5   7.05  29.125  13.0  30.0  23.45
ten   10.0000  ...  10.0000  10.0000  10.0  10.00  10.000  10.0  10.0  10.00

       889    890
age   26.0  32.00
fare  30.0   7.75
ten   10.0  10.00

[3 rows x 891 columns]

In [195]:
# 사용자 함수 정의
def add_two_obj(a, b):    # 두 객체의 합
    return a + b

In [219]:
# 데이터프레임의 2개 열을 선택하여 적용
# x=df, a=df['age'], b=df['ten']
df['add'] = df.apply(lambda x: , axis=1)   
print(df.head())

    age     fare  ten   add
0  22.0   7.2500   10  32.0
1  38.0  71.2833   10  48.0
2  26.0   7.9250   10  36.0
3  35.0  53.1000   10  45.0
4  35.0   8.0500   10  45.0

## 문제
<h4> 칼럼(age,fare,ten) 의 합을 구하여 , 새로운 컬럼 (tot) 대입하라,  apply() 함수를 이용

In [284]:
# titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]
df['ten'] = 10
print(df.head())
print('\n')

    age     fare  ten
0  22.0   7.2500   10
1  38.0  71.2833   10
2  26.0   7.9250   10
3  35.0  53.1000   10
4  35.0   8.0500   10

In [285]:
def add_all(a):
    return a.sum()

In [282]:
tot = df.apply(lambda n :.)

SyntaxError: invalid syntax (1320281015.py, line 1)

In [287]:
tot = df.apply(lambda n : n.sum(), axis=1)

In [289]:
df['tot'] = tot

In [290]:
print(df.head(5))

    age     fare  ten       tot
0  22.0   7.2500   10   39.2500
1  38.0  71.2833   10  119.2833
2  26.0   7.9250   10   43.9250
3  35.0  53.1000   10   98.1000
4  35.0   8.0500   10   53.0500

## 6.6 데이터 프레임 객체에 함수 매핑

In [296]:
#titanic 데이터셋에서 age, fare 2개 열을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[:, ['age','fare']]

In [299]:
# 각 열의 NaN 찾기 - 데이터프레임 전달하면 데이터프레임을 반환
def missing_value(x):
    print("[missing value]")
    return x.isnull()    

# 각 열의 NaN 개수 반환 - 데이터프레임 전달하면 시리즈 반환
def missing_count(x):    # 
    return missing_value(x).sum()
# 데이터프레임의 총 NaN 개수 - 데이터프레임 전달하면 값을 반환
def totoal_number_missing(x):    
    return missing_count(x).sum()

In [300]:
# 데이터프레임에 pipe() 메소드로 함수 매핑
result_df = df.pipe(missing_value)   
print(result_df.head())
#%%
print(type(result_df))
print('\n')

[missing value]
     age   fare
0  False  False
1  False  False
2  False  False
3  False  False
4  False  False
<class 'pandas.core.frame.DataFrame'>

In [301]:
result_series = df.pipe(missing_count)   
print(result_series)
print(type(result_series))
print('\n')

[missing value]
age     177
fare      0
dtype: int64
<class 'pandas.core.series.Series'>

In [302]:
result_value = df.pipe(totoal_number_missing)   
print(result_value)
print(type(result_value))

[missing value]
177
<class 'numpy.int64'>

In [270]:
# 사용자 함수 정의
def add_objs(a,b,c):    # 두 객체의 합
    return a + b + c

In [241]:
#df3 = df.apply(lambda x: add_three_obj(x[], x['fare'], x['ten'] ), axis=0)

In [271]:
df3.loc["tot"] = df2.apply(lambda x: add_objs(df2.index[0],df2.index[1],df2.index[2]), axis = 0)

In [246]:
c = df2.index[0]
print(c)

age

In [250]:
df2.loc['age']

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: age, Length: 891, dtype: float64

In [272]:
print(df3)

             0           1           2           3           4           5    \
age         22.0        38.0        26.0        35.0        35.0         NaN
fare        7.25     71.2833       7.925        53.1        8.05      8.4583
ten         10.0        10.0        10.0        10.0        10.0        10.0
tot   agefareten  agefareten  agefareten  agefareten  agefareten  agefareten

             6           7           8           9    ...         881  \
age         54.0         2.0        27.0        14.0  ...        33.0
fare     51.8625      21.075     11.1333     30.0708  ...      7.8958
ten         10.0        10.0        10.0        10.0  ...        10.0
tot   agefareten  agefareten  agefareten  agefareten  ...  agefareten

             882         883         884         885         886         887  \
age         22.0        28.0        25.0        39.0        27.0        19.0
fare     10.5167        10.5        7.05      29.125        13.0        30.0
ten         10.0        10.0        10.0        10.0        10.0        10.0
tot   agefareten  agefareten  agefareten  agefareten  agefareten  agefareten

             888         889         890
age          NaN        26.0        32.0
fare       23.45        30.0        7.75
ten         10.0        10.0        10.0
tot   agefareten  agefareten  agefareten

[4 rows x 891 columns]

In [274]:
df4 = df3.transpose()

In [275]:
print(df4)

      age     fare   ten         tot
0    22.0     7.25  10.0  agefareten
1    38.0  71.2833  10.0  agefareten
2    26.0    7.925  10.0  agefareten
3    35.0     53.1  10.0  agefareten
4    35.0     8.05  10.0  agefareten
..    ...      ...   ...         ...
886  27.0     13.0  10.0  agefareten
887  19.0     30.0  10.0  agefareten
888   NaN    23.45  10.0  agefareten
889  26.0     30.0  10.0  agefareten
890  32.0     7.75  10.0  agefareten

[891 rows x 4 columns]

In [193]:
df.apply(add_three_obj(df['fare'],df['ten']))

TypeError: add_three_obj() missing 1 required positional argument: 'c'

In [188]:
print(df.loc[:,['age','fare','ten']])

      age     fare  ten
0    22.0   7.2500   10
1    38.0  71.2833   10
2    26.0   7.9250   10
3    35.0  53.1000   10
4    35.0   8.0500   10
..    ...      ...  ...
886  27.0  13.0000   10
887  19.0  30.0000   10
888   NaN  23.4500   10
889  26.0  30.0000   10
890  32.0   7.7500   10

[891 rows x 3 columns]

## 6.7 열 재구성

In [318]:
# titanic 데이터셋의 부분을 선택하여 데이터프레임 만들기
titanic = sns.load_dataset('titanic')
df = titanic.loc[0:4, 'survived':'age']
print(df, '\n')

# 열 이름의 리스트 만들기
columns = list(df.columns.values)   #기존 열 이름 list 
print("df.columns.values: ", type(df.columns)) #<class 'pandas.core.indexes.base.Index'>
print(columns, '\n')

df_columns = df.columns 
print("df.columns: ", df_columns)
print("df.columns.values: ", df_columns.values)

   survived  pclass     sex   age
0         0       3    male  22.0
1         1       1  female  38.0
2         1       3  female  26.0
3         1       1  female  35.0
4         0       3    male  35.0

df.columns.values:  <class 'pandas.core.indexes.base.Index'>
['survived', 'pclass', 'sex', 'age']

df.columns:  Index(['survived', 'pclass', 'sex', 'age'], dtype='object')
df.columns.values:  ['survived' 'pclass' 'sex' 'age']

In [320]:
#pclass 의 0번째 
print(df['pclass'][0])

3

In [333]:
#pclass 전체 
print(df.loc[ : , ["survived",'sex']])

   survived     sex
0         0    male
1         1  female
2         1  female
3         1  female
4         0    male

In [307]:
# 열 이름을 알파벳 순으로 정렬하기
columns_sorted = sorted(columns)    #알파벳 순으로 정렬
df_sorted = df[columns_sorted]
print(df_sorted, '\n')

    age  pclass     sex  survived
0  22.0       3    male         0
1  38.0       1  female         1
2  26.0       3  female         1
3  35.0       1  female         1
4  35.0       3    male         0

In [308]:
# 열 이름을 기존 순서의 정반대 역순으로 정렬하기
columns_reversed = list(reversed(columns))  
df_reversed = df[columns_reversed]
print(df_reversed, '\n')

    age     sex  pclass  survived
0  22.0    male       3         0
1  38.0  female       1         1
2  26.0  female       3         1
3  35.0  female       1         1
4  35.0    male       3         0

In [309]:
# 열 이름을 사용자가 정의한 임의의 순서로 재배치하기
columns_customed = ['pclass', 'sex', 'age', 'survived']  
df_customed = df[columns_customed]
print(df_customed)

   pclass     sex   age  survived
0       3    male  22.0         0
1       1  female  38.0         1
2       3  female  26.0         1
3       1  female  35.0         1
4       3    male  35.0         0

## 6.8 열분리

In [355]:
# 라이브러리 불러오기
import pandas as pd

# 데이터셋 가져오기
df = pd.read_excel('./주가데이터.xlsx', engine= 'openpyxl')
print(df.head(), '\n')
print(df.dtypes, '\n')

         연월일   당일종가  전일종가     시가     고가     저가     거래량
0 2018-07-02  10100   600  10850  10900  10000  137977
1 2018-06-29  10700   300  10550  10900   9990  170253
2 2018-06-28  10400   500  10900  10950  10150  155769
3 2018-06-27  10900   100  10800  11050  10500  133548
4 2018-06-26  10800   350  10900  11000  10700   63039

연월일     datetime64[ns]
당일종가             int64
전일종가             int64
시가               int64
고가               int64
저가               int64
거래량              int64
dtype: object

In [348]:
df['연월일'] = df['연월일'].astype('str')

In [349]:
dates = df['연월일'].str.split('-')

In [356]:
print(dates.head(),'\n')

0    2018-07-02
1    2018-06-29
2    2018-06-28
3    2018-06-27
4    2018-06-26
Name: 연월일, dtype: object

In [357]:
# Mac 에서 Excel File을 가져올때 아래 코드를 실행 시켜야한다. 
dates = pd.to_datetime(df['연월일'])

In [358]:
dates = df['연월일']
df_y = dates.dt.year 
df_m = dates.dt.month
df_d = dates.dt.day

In [343]:
df['연'] = dates.str.get(0)
df['월'] = dates.str.get(1)
df['일'] = dates.str.get(2)

In [344]:
print(df)

           연월일   당일종가  전일종가     시가     고가     저가     거래량     연   월   일
0   2018-07-02  10100   600  10850  10900  10000  137977  2018  07  02
1   2018-06-29  10700   300  10550  10900   9990  170253  2018  06  29
2   2018-06-28  10400   500  10900  10950  10150  155769  2018  06  28
3   2018-06-27  10900   100  10800  11050  10500  133548  2018  06  27
4   2018-06-26  10800   350  10900  11000  10700   63039  2018  06  26
5   2018-06-25  11150   150  11400  11450  11000   55519  2018  06  25
6   2018-06-22  11300   100  11250  11450  10750  134805  2018  06  22
7   2018-06-21  11200   350  11350  11750  11200  133002  2018  06  21
8   2018-06-20  11550   250  11200  11600  10900  308596  2018  06  20
9   2018-06-19  11300   700  11850  11950  11300  180656  2018  06  19
10  2018-06-18  12000  1400  13400  13400  12000  309787  2018  06  18
11  2018-06-15  13400    50  13600  13600  12900  201376  2018  06  15
12  2018-06-14  13450   250  13200  13700  13150  347451  2018  06  14
13  2018-06-12  13200  1250  12200  13300  12050  558148  2018  06  12
14  2018-06-11  11950     0  12000  12250  11950   62293  2018  06  11
15  2018-06-08  11950     0  11950  12200  11800   59258  2018  06  08
16  2018-06-07  11950   200  12200  12300  11900   49088  2018  06  07
17  2018-06-05  12150   250  11800  12250  11800   42485  2018  06  05
18  2018-06-04  11900     0  11900  12200  11700   25171  2018  06  04
19  2018-06-01  11900   100  11800  12100  11750   32062  2018  06  01

## 6.9 필터링

In [361]:
# titanic 데이터셋 로딩
titanic = sns.load_dataset('titanic')

# 나이가 10대(10~19세)인 승객만 따로 선택
mask1 = (titanic.age >= 10) & (titanic.age < 20)

#시리즈에서 같은 인덱스에서 Mask1의 값이 True인 행만 선택 
df_teenage = titanic.loc[mask1, :] # 마스크 적용 , 선택된 행 9,14,22,27,38 
print(df_teenage.head(10))
print('\n')

    survived  pclass     sex   age  sibsp  parch      fare embarked   class  \
9          1       2  female  14.0      1      0   30.0708        C  Second
14         0       3  female  14.0      0      0    7.8542        S   Third
22         1       3  female  15.0      0      0    8.0292        Q   Third
27         0       1    male  19.0      3      2  263.0000        S   First
38         0       3  female  18.0      2      0   18.0000        S   Third
39         1       3  female  14.0      1      0   11.2417        C   Third
44         1       3  female  19.0      0      0    7.8792        Q   Third
49         0       3  female  18.0      1      0   17.8000        S   Third
59         0       3    male  11.0      5      2   46.9000        S   Third
67         0       3    male  19.0      0      0    8.1583        S   Third

      who  adult_male deck  embark_town alive  alone
9   child       False  NaN    Cherbourg   yes  False
14  child       False  NaN  Southampton    no   True
22  child       False  NaN   Queenstown   yes   True
27    man        True    C  Southampton    no  False
38  woman       False  NaN  Southampton    no  False
39  child       False  NaN    Cherbourg   yes  False
44  woman       False  NaN   Queenstown   yes   True
49  woman       False  NaN  Southampton    no  False
59  child       False  NaN  Southampton    no  False
67    man        True  NaN  Southampton    no   True

In [363]:
# 나이가 10세 미만(0~9세)이고 여성인 승객만 따로 선택
mask2 = (titanic.age < 10) & (titanic.sex == 'female')
df_female_under10 = titanic.loc[mask2, :]
print(df_female_under10.head())
print('\n')

     survived  pclass     sex  age  sibsp  parch     fare embarked   class  \
10          1       3  female  4.0      1      1  16.7000        S   Third
24          0       3  female  8.0      3      1  21.0750        S   Third
43          1       2  female  3.0      1      2  41.5792        C  Second
58          1       2  female  5.0      1      2  27.7500        S  Second
119         0       3  female  2.0      4      2  31.2750        S   Third

       who  adult_male deck  embark_town alive  alone
10   child       False    G  Southampton   yes  False
24   child       False  NaN  Southampton    no  False
43   child       False  NaN    Cherbourg   yes  False
58   child       False  NaN  Southampton   yes  False
119  child       False  NaN  Southampton    no  False

In [366]:
# 나이가 10세 미만(0~9세) 또는 60세 이상인 승객의 age, sex, alone 열만 선택
mask3 = (titanic.age < 10) | (titanic.age >= 60)
df_under10_morethan60 = titanic.loc[mask3, ['age', 'sex', 'alone']]
print(df_under10_morethan60.head())

     age     sex  alone
7    2.0    male  False
10   4.0  female  False
16   2.0    male  False
24   8.0  female  False
33  66.0    male   True

### 6-10 isin() 메소드 활용

In [372]:
# titanic 데이터셋 로딩
titanic = sns.load_dataset('titanic')

# IPyhton 디스플레이 설정 변경 - 출력할 최대 열의 개수
pd.set_option('display.max_columns', 10)  
    
# 함께 탑승한 형제 또는 배우자의 수가 3, 4, 5인 승객만 따로 추출 - 불린 인덱싱
mask3 = titanic['sibsp'] == 3
mask4 = titanic['sibsp'] == 4
mask5 = titanic['sibsp'] == 5
df_boolean = titanic[mask3 | mask4 | mask5]
print(df_boolean.head())
#print(info(df_boolean.))
print('\n')

    survived  pclass     sex   age  sibsp  ...  adult_male  deck  embark_town  \
7          0       3    male   2.0      3  ...       False   NaN  Southampton
16         0       3    male   2.0      4  ...       False   NaN   Queenstown
24         0       3  female   8.0      3  ...       False   NaN  Southampton
27         0       1    male  19.0      3  ...        True     C  Southampton
50         0       3    male   7.0      4  ...       False   NaN  Southampton

   alive  alone
7     no  False
16    no  False
24    no  False
27    no  False
50    no  False

[5 rows x 15 columns]

In [371]:
# isin() 메서드 활용하여 동일한 조건으로 추출
isin_filter = titanic['sibsp'].isin([3, 4, 5])
df_isin = titanic[isin_filter]
print(df_isin.head())

    survived  pclass     sex   age  sibsp  ...  adult_male  deck  embark_town  \
7          0       3    male   2.0      3  ...       False   NaN  Southampton
16         0       3    male   2.0      4  ...       False   NaN   Queenstown
24         0       3  female   8.0      3  ...       False   NaN  Southampton
27         0       1    male  19.0      3  ...        True     C  Southampton
50         0       3    male   7.0      4  ...       False   NaN  Southampton

   alive  alone
7     no  False
16    no  False
24    no  False
27    no  False
50    no  False

[5 rows x 15 columns]

## 6.11 : 4. 데이터 합치기

In [376]:
# titanic 데이터셋 로딩
titanic = sns.load_dataset('titanic')

# IPyhton 디스플레이 설정 변경 - 출력할 최대 열의 개수
pd.set_option('display.max_columns', 20)

In [377]:
# 함께 탑승한 형제 또는 배우자의 수가 3, 4, 5인 승객만 따로 추출 - 불린 인덱싱
mask3 = titanic['sibsp'] == 3
mask4 = titanic['sibsp'] == 4
mask5 = titanic['sibsp'] == 5
df_boolean = titanic[mask3 | mask4 | mask5]
print(df_boolean.head())
print('\n')

    survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
7          0       3    male   2.0      3      1   21.0750        S  Third
16         0       3    male   2.0      4      1   29.1250        Q  Third
24         0       3  female   8.0      3      1   21.0750        S  Third
27         0       1    male  19.0      3      2  263.0000        S  First
50         0       3    male   7.0      4      1   39.6875        S  Third

      who  adult_male deck  embark_town alive  alone
7   child       False  NaN  Southampton    no  False
16  child       False  NaN   Queenstown    no  False
24  child       False  NaN  Southampton    no  False
27    man        True    C  Southampton    no  False
50  child       False  NaN  Southampton    no  False

In [378]:
# isin() 메서드 활용하여 동일한 조건으로 추출
isin_filter = titanic['sibsp'].isin([3, 4, 5])
df_isin = titanic[isin_filter]
print(df_isin.head())

    survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
7          0       3    male   2.0      3      1   21.0750        S  Third
16         0       3    male   2.0      4      1   29.1250        Q  Third
24         0       3  female   8.0      3      1   21.0750        S  Third
27         0       1    male  19.0      3      2  263.0000        S  First
50         0       3    male   7.0      4      1   39.6875        S  Third

      who  adult_male deck  embark_town alive  alone
7   child       False  NaN  Southampton    no  False
16  child       False  NaN   Queenstown    no  False
24  child       False  NaN  Southampton    no  False
27    man        True    C  Southampton    no  False
50  child       False  NaN  Southampton    no  False

## 6-11 데이터 프레임 연결 2

In [379]:
# 데이터프레임 만들기
df1 = pd.DataFrame({'a': ['a0', 'a1', 'a2', 'a3'],
                    'b': ['b0', 'b1', 'b2', 'b3'],
                    'c': ['c0', 'c1', 'c2', 'c3']},
                    index=[0, 1, 2, 3])
 
df2 = pd.DataFrame({'a': ['a2', 'a3', 'a4', 'a5'],
                    'b': ['b2', 'b3', 'b4', 'b5'],
                    'c': ['c2', 'c3', 'c4', 'c5'],
                    'd': ['d2', 'd3', 'd4', 'd5']},
                    index=[2, 3, 4, 5])

print(df1, '\n')
print(df2, '\n')

    a   b   c
0  a0  b0  c0
1  a1  b1  c1
2  a2  b2  c2
3  a3  b3  c3

    a   b   c   d
2  a2  b2  c2  d2
3  a3  b3  c3  d3
4  a4  b4  c4  d4
5  a5  b5  c5  d5

In [380]:
# 2개의 데이터프레임을 위 아래 행 방향으로 이어 붙이듯 연결하기 
result1 = pd.concat([df1, df2])
print(result1, '\n')

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
2  a2  b2  c2   d2
3  a3  b3  c3   d3
4  a4  b4  c4   d4
5  a5  b5  c5   d5

In [381]:
# ignore_index=True 옵션 설정하기 
result2 = pd.concat([df1, df2], ignore_index=True)
print(result2, '\n')

    a   b   c    d
0  a0  b0  c0  NaN
1  a1  b1  c1  NaN
2  a2  b2  c2  NaN
3  a3  b3  c3  NaN
4  a2  b2  c2   d2
5  a3  b3  c3   d3
6  a4  b4  c4   d4
7  a5  b5  c5   d5

In [382]:
# join='inner' 옵션 적용하기(교집합)
result3_in = pd.concat([df1, df2], axis=1, join='inner')
print(result3_in, '\n')

    a   b   c   a   b   c   d
2  a2  b2  c2  a2  b2  c2  d2
3  a3  b3  c3  a3  b3  c3  d3

In [383]:
# 시리즈 만들기
sr1 = pd.Series(['e0', 'e1', 'e2', 'e3'], name='e')
sr2 = pd.Series(['f0', 'f1', 'f2'], name='f', index=[3, 4, 5])
sr3 = pd.Series(['g0', 'g1', 'g2', 'g3'], name='g')

In [384]:
# df1과 sr1을 좌우 열 방향으로 연결하기
result4 = pd.concat([df1, sr1], axis=1)
print(result4, '\n')

    a   b   c   e
0  a0  b0  c0  e0
1  a1  b1  c1  e1
2  a2  b2  c2  e2
3  a3  b3  c3  e3

In [385]:
# df2과 sr2을 좌우 열 방향으로 연결하기
result5 = pd.concat([df2, sr2], axis=1, sort=True)
print(result5, '\n')

    a   b   c   d    f
2  a2  b2  c2  d2  NaN
3  a3  b3  c3  d3   f0
4  a4  b4  c4  d4   f1
5  a5  b5  c5  d5   f2

In [386]:
# sr1과 sr3을 좌우 열 방향으로 연결하기
result6 = pd.concat([sr1, sr3], axis=1)
print(result6, '\n')

    e   g
0  e0  g0
1  e1  g1
2  e2  g2
3  e3  g3

In [387]:
result7 = pd.concat([sr1, sr3], axis=0)
print(result7, '\n')

0    e0
1    e1
2    e2
3    e3
0    g0
1    g1
2    g2
3    g3
dtype: object